{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/08/16/hello-world/"},{"title":"markdown_learning","text":"abstractmarkdown learning recording 一级二级三级四级五级h1h2h3h4h5这是一级标题这是二级标题 这段文字高亮显示 点击跳转百度 图片比链接引用多一个感叹号 无序列表 *黄瓜*玉米*茄子 +黄瓜+玉米+茄子 -黄瓜-玉米-茄子 有序列表 1.黄瓜2.玉米3.茄子 段落一 小段一 段落二 小段二 段落一 区块标记一 区块二 三 段落二 区块标记二 这是斜体这是斜体 加粗加粗粗斜删除 下划线 脚注这是一个脚注示例 [^abc]。[^abc]: 这是脚注。 高级用法插入代码块print()函数 var x = 3 123$(document).ready(function () { alert('RUNOOB');}); fun (x: Int, y: Int): Int { return x + y } 表头 条目 条目二 项目 项目一 项目二 注：三个短斜杠左右的冒号用于控制对齐方式，只放置左边冒号表示文字居左，只放置右边冒号表示文字居右，如果两边都放置冒号表示文字居中。 #其他##特殊符号处理 \\用来插入特殊符号 /#\\ TestTest","link":"/2021/08/16/markdown_learning/"},{"title":"hexo_auto","text":"Abstracthexo blog auto new blog and publish blog hexo auto new blog using hexo scaffold for example new a .bat file and put this code code1234567@echo offset /p a= input title:echo title:%a%call hexo new post &quot;%a%&quot;cd .\\source\\_posts\\Start %a%.mdpause hexo auto pushnew a .bat file and put this code code12call hexo d -gpause 参考文章:参考链接","link":"/2021/08/16/hexo-auto/"},{"title":"VPN-v2ray establish on your own VPS","text":"abstractThis artical will give you an simple way to bulid your own VPN preparation A domain name A VPS An acount of the Cloudflare with the free plan is enough A software XSHELL to connect your VPS 1.Connect your server by XSHELL 2.Log in the clondflare and DNS your domain name to your server ipAfter DNS, don’t light the yellow cloudMake sure your domain name’s DNS server is under the cloudflare. 3.run commandbash &lt;(curl -s -L https://git.io/v2ray.sh) choose 1 to install choose 4 to select transport protocols entere your domain name(second-level domain also useful) then y TLS “y” the rest just press enter wait for the install finish Back to cloudflare to light the yellow cloud 4.get the vmess linkrun v2ray linkcopy the link to add in the v2rayN 5.manager the v2rayv2ray infov2ray configv2ray link generate V2Ray linkv2ray infolink generate V2Ray info linkv2ray qr v2ray generate QR codev2ray ss edit Shadowsocks infov2ray ssinfo check the Shadowsocks infov2ray ssqr generate Shadowsocks QR codev2ray statusv2ray start v2ray stop v2ray restart v2ray logv2ray update v2ray update.sh v2ray uninstall refer link","link":"/2021/08/21/VPN-v2ray-establish-on-your-own-VPS/"}],"tags":[{"name":"auto","slug":"auto","link":"/tags/auto/"},{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"learning recording","slug":"learning-recording","link":"/tags/learning-recording/"},{"name":"vpn","slug":"vpn","link":"/tags/vpn/"}],"categories":[{"name":"hexo","slug":"hexo","link":"/categories/hexo/"},{"name":"markdown","slug":"markdown","link":"/categories/markdown/"},{"name":"tutorial","slug":"tutorial","link":"/categories/tutorial/"}]}